In [60]:
import pandas as pd
df = pd.read_csv('Titanic.csv')

### Q_1: Create a Pandas Series named survival_series using the Survived column of the DataFrame

In [61]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47,1,0,363272,7,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22,1,1,3101298,12.2875,NaN,S

In [62]:
survival_series = pd.Series(df['Survived'])
print(survival_series)
survival_series.info()

0      0
1      1
2      0
3      0
4      1
      ..
413    0
414    1
415    0
416    0
417    0
Name: Survived, Length: 418, dtype: int64
<class 'pandas.core.series.Series'>
RangeIndex: 418 entries, 0 to 417
Series name: Survived
Non-Null Count  Dtype
--------------  -----
418 non-null    int64
dtypes: int64(1)
memory usage: 3.4 KB

### Q_2: Display the last 3 rows of the DataFrame and check the data type of the Age column

In [63]:
df.tail(3)
type(df['Age'])
df['Age'].info()
#its float64 
#we can do that aswell
df['Age'].dtype

<class 'pandas.core.series.Series'>
RangeIndex: 418 entries, 0 to 417
Series name: Age
Non-Null Count  Dtype
--------------  -----
332 non-null    float64
dtypes: float64(1)
memory usage: 3.4 KB

dtype('float64')

### Q_3 :  Select the Name and Age columns, then filter rows where the passengerâ€™s age is greater than 30

In [64]:
name_age = df[['Name','Age']]
name_age.head(20)

                                                 Name  Age
0                                    Kelly, Mr. James 34.5
1                    Wilkes, Mrs. James (Ellen Needs)   47
2                           Myles, Mr. Thomas Francis   62
3                                    Wirz, Mr. Albert   27
4        Hirvonen, Mrs. Alexander (Helga E Lindqvist)   22
5                          Svensson, Mr. Johan Cervin   14
6                                Connolly, Miss. Kate   30
7                        Caldwell, Mr. Albert Francis   26
8           Abrahim, Mrs. Joseph (Sophie Halaut Easu)   18
9                             Davies, Mr. John Samuel   21
10                                   Ilieff, Mr. Ylio  NaN
11                         Jones, Mr. Charles Cresson   46
12      Snyder, Mrs. John Pillsbury (Nelle Stevenson)   23
13                               Howard, Mr. Benjamin   63
14  Chaffee, Mrs. Herbert Fuller (Carrie Constance...   47
15      del Carlo, Mrs. Sebastiano (Argenia Genovesi)   24
16                                  Keane, Mr. Daniel   35
17                                  Assaf, Mr. Gerios   21
18                       Ilmakangas, Miss. Ida Livija   27
19              Assaf Khalil, Mrs. Mariana (Miriam")"   45

In [65]:
name_age = name_age[name_age['Age']>30]
name_age.head(20)

                                                 Name  Age
0                                    Kelly, Mr. James 34.5
1                    Wilkes, Mrs. James (Ellen Needs)   47
2                           Myles, Mr. Thomas Francis   62
11                         Jones, Mr. Charles Cresson   46
13                               Howard, Mr. Benjamin   63
14  Chaffee, Mrs. Herbert Fuller (Carrie Constance...   47
16                                  Keane, Mr. Daniel   35
19              Assaf Khalil, Mrs. Mariana (Miriam")"   45
20                             Rothschild, Mr. Martin   55
24    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)   48
25                            Robins, Mr. Alexander A   50
28                            Brady, Mr. John Bertram   41
30                       Louch, Mr. Charles Alexander   50
32           Dean, Mrs. Bertram (Eva Georgetta Light)   33
40                                   Karun, Mr. Franz   39
42                              Goldsmith, Mr. Nathan   41
44   Kimball, Mrs. Edwin Nelson Jr (Gertrude Parsons)   45
46                           Chevre, Mr. Paul Romaine   45
48    Bucknell, Mrs. William Robert (Emma Eliza Ward)   60
49     Coutts, Mrs. William (Winnie Minnie" Treanor)"   36

### Q_4: Add a new column FamilySize to the DataFrame, calculated as SibSp + Parch + 1 (including the passenger themselves)

In [66]:
df.head(5)
df['FamilySize'] = df['SibSp'] + df['Parch'] + 1
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47,1,0,363272,7,NaN,S,2
2,894,0,2,"Myles, Mr. Thomas Francis",male,62,0,0,240276,9.6875,NaN,Q,1
3,895,0,3,"Wirz, Mr. Albert",male,27,0,0,315154,8.6625,NaN,S,1
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22,1,1,3101298,12.2875,NaN,S,3

#### Q_5: Fill missing values in the Age column with the mean age then Group the data by Pclass and calculate the average age for each class

In [67]:
#now lets calculate the average afe for each class by Pclass 
df['Pclass'].unique() #this is an example to see the array of classes
df['Pclass'].value_counts() #this gets the count of each class
df.groupby('Pclass', as_index=False)['Age'].mean() #as index false make it appear as it is not an index

   Pclass     Age
0       1 40.9184
1       2 28.7775
2       3 24.0279

In [68]:
mean_age = df['Age'].mean()
print(mean_age)
df['Age'] = df['Age'].fillna(mean_age)
df['Age'] = (df['Age'] * 2).round() / 2
#i searched and did this to make the format look good and look like the age before i fill it with the mean actaully
pd.options.display.float_format = '{:g}'.format
df.head(40)

30.272590361445783

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47,1,0,363272,7,NaN,S,2
2,894,0,2,"Myles, Mr. Thomas Francis",male,62,0,0,240276,9.6875,NaN,Q,1
3,895,0,3,"Wirz, Mr. Albert",male,27,0,0,315154,8.6625,NaN,S,1
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22,1,1,3101298,12.2875,NaN,S,3
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14,0,0,7538,9.225,NaN,S,1
6,898,1,3,"Connolly, Miss. Kate",female,30,0,0,330972,7.6292,NaN,Q,1
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26,1,1,248738,29,NaN,S,3
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18,0,0,2657,7.2292,NaN,C,1
9,901,0,3,"Davies, Mr. John Samuel",male,21,2,0,A/4 48871,24.15,NaN,S,3
10,902,0,3,"Ilieff, Mr. Ylio",male,30.5,0,0,349220,7.8958,NaN,S,1
11,903,0,1,"Jones, Mr. Charles Cresson",male,46,0,0,694,26,NaN,S,1
12,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23,1,0,21228,82.2667,B45,S,2
13,905,0,2,"Howard, Mr. Benjamin",male,63,1,0,24065,26,NaN,S,2
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47,1,0,W.E.P. 5734,61.175,E31,S,2
15,907,1,2,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",female,24,1,0,SC/PARIS 2167,27.7208,NaN,C,2
16,908,0,2,"Keane, Mr. Daniel",male,35,0,0,233734,12.35,NaN,Q,1
17,909,0,3,"Assaf, Mr. Gerios",male,21,0,0,2692,7.225,NaN,C,1
18,910,1,3,"Ilmakangas, Miss. Ida Livija",female,27,1,0,STON/O2. 3101270,7.925,NaN,S,2
19,911,1,3,"Assaf Khalil, Mrs. Mariana (Miriam"")""",female,45,0,0,2696,7.225,NaN,C,1
20,912,0,1,"Rothschild, Mr. Martin",male,55,1,0,PC 17603,59.4,NaN,C,2
21,913,0,3,"Olsen, Master. Artur Karl",male,9,0,1,C 17368,3.1708,NaN,S,2
22,914,1,1,"Flegenheim, Mrs. Alfred (Antoinette)",female,30.5,0,0,PC 17598,31.6833,NaN,S,1
23,915,0,1,"Williams, Mr. Richard Norris II",male,21,0,1,PC 17597,61.3792,NaN,C,2
24,916,1,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48,1,3,PC 17608,262.375,B57 B59 B63 B66,C,5
25,917,0,3,"Robins, Mr. Alexander A",male,50,1,0,A/5. 3337,14.5,NaN,S,2
26,918,1,1,"Ostby, Miss. Helene Ragnhild",female,22,0,1,113509,61.9792,B36,C,2
27,919,0,3,"Daher, Mr. Shedid",male,22.5,0,0,2698,7.225,NaN,C,1
28,920,0,1,"Brady, Mr. John Bertram",male,41,0,0,113054,30.5,A21,S,1
29,921,0,3,"Samaan, Mr. Elias",male,30.5,2,0,2662,21.6792,NaN,C,3
30,922,0,2,"Louch, Mr. Charles Alexander",male,50,1,0,SC/AH 3085,26,NaN,S,2
31,923,0,2,"Jefferys, Mr. Clifford Thomas",male,24,2,0,C.A. 31029,31.5,NaN,S,3
32,924,1,3,"Dean, Mrs. Bertram (Eva Georgetta Light)",female,33,1,2,C.A. 2315,20.575,NaN,S,4
33,925,1,3,"Johnston, Mrs. Andrew G (Elizabeth Lily"" Watson)""",female,30.5,1,2,W./C. 6607,23.45,NaN,S,4
34,926,0,1,"Mock, Mr. Philipp Edmund",male,30,1,0,13236,57.75,C78,C,2
35,927,0,3,"Katavelas, Mr. Vassilios (Catavelas Vassilios"")""",male,18.5,0,0,2682,7.2292,NaN,C,1
36,928,1,3,"Roth, Miss. Sarah A",female,30.5,0,0,342712,8.05,NaN,S,1
37,929,1,3,"Cacic, Miss. Manda",female,21,0,0,315087,8.6625,NaN,S,1
38,930,0,3,"Sap, Mr. Julius",male,25,0,0,345768,9.5,NaN,S,1
39,931,0,3,"Hee, Mr. Ling",male,30.5,0,0,1601,56.4958,NaN,S,1

#### Q_Bonus: Calculate the survival rate (mean of Survived) for each gender (Sex)

In [72]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47,1,0,363272,7,NaN,S,2
2,894,0,2,"Myles, Mr. Thomas Francis",male,62,0,0,240276,9.6875,NaN,Q,1
3,895,0,3,"Wirz, Mr. Albert",male,27,0,0,315154,8.6625,NaN,S,1
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22,1,1,3101298,12.2875,NaN,S,3

In [ ]:
df['Sex'].value_counts().to_frame() # this returns the count of each one
#we can use to_frame method to turn any series into data frame for better visualization

        count
Sex
male      266
female    152

In [85]:
df.groupby('Sex')['Survived'].mean().to_frame() #we can see that the average of survived here is appearing as one and zero, so is that cause the data type is int??
df['Survived'].dtype #yes it's seen that its int so we need to turn it into a float
#lets search how to convert int to float in pandas
df['Survived'] = df['Survived'].astype('float32')
df['Survived'].dtype
df.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47,1,0,363272,7,NaN,S,2
2,894,0,2,"Myles, Mr. Thomas Francis",male,62,0,0,240276,9.6875,NaN,Q,1
3,895,0,3,"Wirz, Mr. Albert",male,27,0,0,315154,8.6625,NaN,S,1
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22,1,1,3101298,12.2875,NaN,S,3
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14,0,0,7538,9.225,NaN,S,1
6,898,1,3,"Connolly, Miss. Kate",female,30,0,0,330972,7.6292,NaN,Q,1
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26,1,1,248738,29,NaN,S,3
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18,0,0,2657,7.2292,NaN,C,1
9,901,0,3,"Davies, Mr. John Samuel",male,21,2,0,A/4 48871,24.15,NaN,S,3
10,902,0,3,"Ilieff, Mr. Ylio",male,30.5,0,0,349220,7.8958,NaN,S,1
11,903,0,1,"Jones, Mr. Charles Cresson",male,46,0,0,694,26,NaN,S,1
12,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23,1,0,21228,82.2667,B45,S,2
13,905,0,2,"Howard, Mr. Benjamin",male,63,1,0,24065,26,NaN,S,2
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47,1,0,W.E.P. 5734,61.175,E31,S,2
15,907,1,2,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",female,24,1,0,SC/PARIS 2167,27.7208,NaN,C,2
16,908,0,2,"Keane, Mr. Daniel",male,35,0,0,233734,12.35,NaN,Q,1
17,909,0,3,"Assaf, Mr. Gerios",male,21,0,0,2692,7.225,NaN,C,1
18,910,1,3,"Ilmakangas, Miss. Ida Livija",female,27,1,0,STON/O2. 3101270,7.925,NaN,S,2
19,911,1,3,"Assaf Khalil, Mrs. Mariana (Miriam"")""",female,45,0,0,2696,7.225,NaN,C,1

In [84]:
#now let's do it again
df.groupby('Sex')['Survived'].mean().to_frame()

        Survived
Sex
female         1
male           0

In [ ]:
# i think my calculations are correct but the data itself has a problem.